In [46]:
import pandas as pd
import numpy as np

In [47]:
data = pd.DataFrame({'Qu1' : [1,3,4,3,4], 'Qu2' : [2,3,1,2,3], 'Qu3' : [1,5,2,4,4]})

In [48]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [127]:
# value_counts는 원래 특정 칼럼에만 적용 가능. dataframe아니라 series만. 근데 apply로 이렇게 !
result = data.apply(pd.value_counts).fillna(0)

In [50]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [137]:
df = pd.DataFrame({'num_legs': [2, 4, 4, 6],
                   'num_wings': [2, 0,99,200]},
                  index=['falcon', 'dog', 'cat', 'ant'])
df['zizi'] = 1,5,3,2
df

        num_legs  num_wings  zizi
falcon         2          2     1
dog            4          0     5
cat            4         99     3
ant            6        200     2

# groupby랑 value_counts는 다르다. groupby는 한 컬럼에 있는 값들을 , 다른 칼럼들과 연관하여 세주고, value_counts는 그 칼럼 안의 값들의 frequency를 세준다..

In [148]:
df['num_legs'].value_counts

<bound method IndexOpsMixin.value_counts of falcon    2
dog       4
cat       4
ant       6
Name: num_legs, dtype: int64>

In [149]:
df.groupby(by = ['num_legs','zizi']).sum()

               num_wings
num_legs zizi
2        1             2
4        3            99
         5             0
6        2           200

In [150]:
df.groupby(['num_legs','zizi']).count()

               num_wings
num_legs zizi
2        1             1
4        3             1
         5             1
6        2             1

# read - file 시작

In [159]:
import os
# 지금 경로!
os.getcwd()

'C:\\Users\\USER\\파이썬pdf'

In [160]:
os.chdir('C:/Users/USER/파이썬pdf/pydata-book-2nd-edition/pydata-book-2nd-edition')

In [161]:
os.getcwd()

'C:\\Users\\USER\\파이썬pdf\\pydata-book-2nd-edition\\pydata-book-2nd-edition'

In [162]:
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [163]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [212]:
# header는 위에 어디서부터 읽나. 디폴트는 0 인데 칼럼이없으면 None으로 해야함
pd.read_csv('examples/ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [165]:
pd.read_csv('examples/ex2.csv', header = 0)

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [166]:
# 칼럼 이름 설정 가능
pd.read_csv('examples/ex2.csv', names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [167]:
# 또 이렇게 인덱스 칼럼을 설정해줄 수 있음
pd.read_csv('examples/ex2.csv', names = ['a','b','c','d','message'], index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [172]:
!type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [176]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col = ['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [178]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [183]:
pd.read_table('examples/ex3.txt', sep ='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [198]:
# 이렇게 주석처리된것들이 있는 csv이면?
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [199]:
# skiprows 해주자
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [200]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [208]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [204]:
result = pd.read_csv("examples/ex5.csv", na_values=['NULL'])

In [207]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [209]:
sentinels = {'message' :['foo', 'NA'], 'something' : ['two']}

In [211]:
pd.read_csv('examples/ex5.csv', na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

# 이거는 은근 유용할듯 / entire 데이터가 아니라 일부만 읽기!!!!

In [225]:
pd.read_csv('examples/ex6.csv')

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [223]:
# 일부만 읽자!
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [220]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [232]:
# 사이즈 지정
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
chunker

In [221]:
pd.read_csv('examples/ex6.csv', nrwos=5)

TypeError: parser_f() got an unexpected keyword argument 'nrwos'

In [233]:
tot = pd.Series([])

C:\Users\USER\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [216]:
type(pd.options.display.max_rows)

int

In [234]:
tot

Series([], dtype: float64)

In [242]:
for piece in chunker :
    tot = tot.add(piece['key'].value_counts(), fill_value = 132)

In [243]:
chunker['key']#.value_counts()

TypeError: 'TextFileReader' object is not subscriptable

In [245]:
tot = tot.sort_values(ascending=False)

In [241]:
pd.DataFrame(chunker)

Empty DataFrame
Columns: []
Index: []

In [247]:
tot[:10]

E    500.0
X    496.0
L    478.0
O    475.0
Q    472.0
M    470.0
J    469.0
F    467.0
K    466.0
H    462.0
dtype: float64

In [248]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [256]:
data.to_csv(sys.stdout, sep='♥')

♥something♥a♥b♥c♥d♥message
0♥one♥1♥2♥3.0♥4♥
1♥two♥5♥6♥♥8♥world
2♥three♥9♥10♥11.0♥12♥foo

In [266]:
import sys

In [270]:
dates = pd.date_range('1/1/2020',periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts

2020-01-01    0
2020-01-02    1
2020-01-03    2
2020-01-04    3
2020-01-05    4
2020-01-06    5
2020-01-07    6
Freq: D, dtype: int32

In [277]:
import csv
f = open('examples/ex7.csv')
f

In [280]:
reader = csv.reader(f)

In [281]:
reader

In [282]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [288]:
with open('examples/ex7.csv') as f :
    lines = list(csv.reader(f))

In [289]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [290]:
header, values = lines[0], lines[1:]

In [302]:
data_dict = {h : v for h,v in zip(header, zip(*values))}

In [303]:
data_dict

{'a': (['1', '2', '3'],), 'b': (['1', '2', '3'],)}

In [296]:
header

['a', 'b', 'c']

In [297]:
values

[['1', '2', '3'], ['1', '2', '3']]